Public Attributes | List of all members
API_MeshLevelCoord Struct Reference
Element Manager API
Describes one coordinate of a mesh level line. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Coord3D  | c
The 3D coordinate of the vertex.
Int32  | vertexID
Vertex ID unique in the given mesh; can be used to track the vertices.
Detailed Description
Describes one coordinate of a mesh level line.
Member Data Documentation
◆ c
 API_MeshLevelCoord::c
The 3D coordinate of the vertex.
◆ vertexID
 API_MeshLevelCoord::vertexID
Vertex ID unique in the given mesh; can be used to track the vertices.